agg_bench/benchmark_logs_20251020_230345/client_tp8_dp1_concurrency8.log
INFO 10-20 23:55:05 [__init__.py:225] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x722821fce0c0>, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=2048, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=8, model='meta-llama/Meta-Llama-3-70B-Instruct', tokenizer='meta-llama/Meta-Llama-3-70B-Instruct', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='benchmark_logs_20251020_230345', result_filename='benchmark_tp8_dp1_concurrency8.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
INFO 10-20 23:55:10 [datasets.py:603] Sampling input_len from [1023, 1023] and output_len from [2048, 2048]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 52:05:12 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 256/256 [07:47<00:00,  1.83s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  467.90    
Total input tokens:                      261888    
Total generated tokens:                  302150    
Request throughput (req/s):              0.55      
Output token throughput (tok/s):         645.76    
Peak output token throughput (tok/s):    672.00    
Peak concurrent requests:                23.00     
Total Token throughput (tok/s):          1205.48   
---------------Time to First Token----------------
Mean TTFT (ms):                          27.80     
Median TTFT (ms):                        26.50     
P99 TTFT (ms):                           43.82     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          12.11     
Median TPOT (ms):                        12.04     
P99 TPOT (ms):                           13.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           12.03     
Median ITL (ms):                         12.01     
P99 ITL (ms):                            13.00     
==================================================